{
  "images": [
    {
      "id": 1,
      "date": "2021-04-19",
      "explanation": "What does the center of our galaxy look like?  In visible light, the Milky Way's center is hidden by clouds of obscuring dust and gas. But in this stunning vista, the Spitzer Space Telescope's infrared cameras, penetrate much of the dust revealing the stars of the crowded galactic center region. A mosaic of many smaller snapshots, the detailed, false-color image shows older, cool stars in bluish hues. Red and brown glowing dust clouds are associated with young, hot stars in stellar nurseries. The very center of the Milky Way has recently been found capable of forming newborn stars. The galactic center lies some 26,700 light-years away, toward the constellation Sagittarius. At that distance, this picture spans about 900 light-years.",
      "stars": 15,
      "image": "https://apod.nasa.gov/apod/image/2104/GalacticCore_SpitzerSchmidt_960.jpg"
    },
    {
      "id": 2,
      "date": "2021-04-20",
      "explanation": "What's the best way to explore Mars? Perhaps there is no single best way, but a newly demonstrated method shows tremendous promise: flight. Powered flight has the promise to search vast regions and scout out particularly interesting areas for more detailed investigation.  Yesterday, for the first time, powered flight was demonstrated on Mars by a small helicopter named Ingenuity.  In the featured video, Ingenuity is first imaged by the Perseverance rover sitting quietly on the Martian surface.  After a few seconds, Ingenuity's long rotors begin to spin, and a few seconds after that -- history is made as Ingenuity actually takes off, hovers for a few seconds, and then lands safely.  More tests of Ingenuity's unprecedented ability are planned over the next few months.  Flight may help humanity better explore not only Mars, but Saturn's moon Titan over the next few decades.",
      "stars": 0,
      "image": "https://www.youtube.com/embed/wMnOo2zcjXA?rel=0"
    },
    {
      "id": 3,
      "date": "2021-04-21",
      "explanation": "When galaxies collide -- what happens to their magnetic fields? To help find out, NASA pointed SOFIA, its flying 747, at galactic neighbor Centaurus A to observe the emission of polarized dust -- which traces magnetic fields.  Cen A's unusual shape results from the clash of two galaxies with jets powered by gas accreting onto a central supermassive black hole.  In the resulting featured image, SOFIA-derived magnetic streamlines are superposed on ESO (visible: white), APEX (submillimeter: orange), Chandra (X-rays: blue), and Spitzer (infrared: red) images. The magnetic fields were found to be parallel to the dust lanes on the outskirts of the galaxy but distorted near the center.  Gravitational forces near the black hole accelerate ions and enhance the magnetic field.  In sum, the collision not only combined the galaxies’ masses -- but amplified their magnetic fields.  These results provide new insights into how magnetic fields evolved in the early universe when mergers were more common.",
      "stars": 0,
      "image": "https://apod.nasa.gov/apod/image/2104/CenA_SofiaPlusB_2480.jpg"
    }
  ],
  "comments": [
    {
      "id": 1,
      "imageId": 1,
      "name": "Betsy",
      "content": "Cool Image"
    },
    {
      "id": 2,
      "imageId": 1,
      "name": "Nancy",
      "content": "Those are some pretty colors"
    }
  ]
}